//  Напишите программу, которая на вход 
// принимает два числа и проверяет, 
// является ли второе число квадратом первого.
int numberA = 5;
int numberB = 25;
if (numberA*numberA == numberB)
{
    Console.WriteLine("Yes");
}
else 
{
    Console.WriteLine("No");
}